---
title: Cisco IOS CLI
date: 2022-07-13 12:26:14
permalink: /pages/9876fd/
categories:
  - 网络运维
  - CCNA
  - CCNA知识笔记
tags:
  - 
---
# Cisco IOS CLI

## 路由器组件

>   <img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220617114555686.png" alt="image-20220617114555686" style="zoom:37%;" />
>
>   -   CPU: 执行操作系统的指令;
>   -   RAM 随机访问存储器: RAM中的内容断电消失;
>   -   ROM 只读存储器: 开机自检软件, 路由器启动引导程序, mini IOS
>   -   NVRAM 非易失RAM: 存储启动配置;
>   -   Flash: 运行操作系统(Cisco IOS);
>   -   Interface: 拥有多个物理接口, 用于外部连接;
>
>   >   -   IOS 位于闪存中, 
>   >   -   启动配置(startup-config)存放于 NVRAM 中, 
>   >   -   运行配置(running-config)存放于RAM中

## 路由器的启动步骤

<img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220617115620649.png" alt="image-20220617115620649" style="zoom:50%;" />

>   ##### 启动路由器的过程: 
>
>   1.   启动思科路由器时，它将执行加电自检(POST)。通过加电自检后，它将在闪存中查找思科IOS. 
>   2.   如果找到I0S文件，将把它加载到内存(RAM) 中。(注意，闪存是电可擦除可编程只读存储器，即EEPROM). 
>   3.   IOS 加载后，它将寻找有效配置(启动配置)，这种配置存储在非易失RAM(NVRAM) 中。



## 路由器的功能:

>   对于路由器，必须牢记如下要点:
>
>   -   默认情况下，路由器**不转发任何广播分组和组播分组**。
>   -   路由器根据IP数据报报头中的逻辑地址确定将分组转发到哪个下一跳路由器。
>   -   路由器可使用管理员创建的**访问列表(ACL)**控制可进出接口的分组类型，以提高安全性。
>   -   必要时，路由器可在同一个接口提供第2层桥接功能和路由功能。
>   -   第3层设备(这里指的是路由器)在虚拟LAN (VLAN) 之间提供连接。
>   -   路由器可为特定类型的网络数据流提供QoS (Quality of Service .服务质量)。

## Cisco IOS

>   Cisco IOS(Internetwork Operating System, 互联网络操作系统) is the operating system used on Cisco devices, like Windows on a PC。注意，内核是操作系统不可或缺的基本部分，它分配资源，管理诸如低级硬件接口和安全等方面, 应用于路由器, 交换机, Access Point等设备;
>   
>可提供下列网络服务:
>   
>-   路由选择和分组交换功能;
>   -   提供连接网络资源的可靠性, 安全可靠地访问网络资源;
>   -   提供可扩展性(以方便网络扩容)和冗余性;
>   -   控制访问和禁止未经授权的网络使用，从而提高安全性;

### Cisco IOS 软件镜像文件的命名规则

<img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220617121324343.png" alt="image-20220617121324343" style="zoom:37%;" />

>   #### 思科IOS软件命名规则简单介绍：
>
>   AAAAA-BBBB-CC-DDDD.EE
>   1．  AAAAA    这组字符是说明文件所适用的硬件平台，
>   2．  BBBB       这组字符是说明这个IOS中所包含的特性，
>   3．  CC           这组字符是IOS文件格式，
>   4．  DDDD     这组字符是指出IOS软件版本，
>   5．  EE           这个是IOS文件的后缀。
>
>   ###### 一、“AAAAA”  硬件平台字符组
>
>   比如：
>   	c2600            2600系列路由器
>   	c2800            2800系列路由器
>   	c54sm            Catalyst 5000 RSM/VIP
>   	ics7700          ICS7700
>   	mc3810          MC3810多服务访问集线器
>   	regen             15104光连网系统
>   	rpm               MGX 8850 RPM
>   	rsp               7500系列路由器
>   	vbr 7200        UBR7200通用宽带路由器
>   	vg200            VG200语音网关等。
>
>   ###### 二、“BBBB” 表示特性的字符串
>
>   我们这说几个常用的，经常会看到的：
>    a          Advanced Peer-to-Peer Networking(APPN)特性
>    boot        引导映像
>    j             企业
>    i             IP
>    ipbase    IP BASE
>    i3            简化的IP，没有BGP、EBP、NHRP
>    i5            带有VoFR的IP
>    k8           IPSec 56
>    k9           IPSec 3DES
>    o            IOS防火墙
>    o3           带在入侵检测系统IDS、SSH的防火墙
>    p            加
>    s             加（NAT、IBM、VPDN、VoIP）
>    v            VIP
>    v5           VoIP
>    x3           语音
>   	56          56位的加密
>
>   ###### 三、“CC”格式字符组
>
>   第一个“C”指出映像的在哪个路由器内存类型中执行。
>   	f      flash,内存
>   	m    RAM
>   	r      ROM
>   	l      运行时刻定位
>
>   如果你正想把Flash卡（闪存卡）从一台路由器上拆除，那么可以看看这个字符是什么。如果是f, 则软件是直接从闪存执行的，这时候就要求安装有闪存，以便IOS软件能够运行。如果是m , 那么路由器已经从Flash（闪存）中读取了IOS软件，压缩之后正在从RAM运行它。在路由器正常引导起来以后，就可以安全的拆除Flash了。
>
>   第二个“C”说明如何进行压缩的
>   	z     zip压缩
>   	x     mzip压缩
>   	w     stac压缩
>
>   ###### 四、“DDDD”版本说明字符组
>
>   ​	指出IOS软件的版本号
>
>   ###### 五、“．EE”文件名还有一个后缀
>
>   如： .bin或者.tar
>
>   
>
>   例：“rsp-jo3sv-mz.122-1.bin”，
>   	rsp          是硬件平台（Cisco 7500系列）。
>   	jo3sv       是出企业级（j）、带IDS的防火墙（o3）、带有NAT/VoIP的IP增强（s）以及通用接口处理器VIP（v）。
>   	mz          表明是运行在路由器的RAM内存中，并且用zip压缩。
>   	122-1          表明是CISCO IOS软件版本12（2）1，即主版本12（2）的第一个维护版本。
>
>   ​	.bin         是这个IOS软件后缀。
>
>   
>
>   -   Cisco IOS 命名规则(整理版)https://blog.51cto.com/piaolang/77299

## Cisco 的设备管理

![image-20220617120340558](https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220617120340558.png)

<img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220617120919873.png" alt="image-20220617120919873" style="zoom:50%;" />

## 实践操作

>   -   VMware 虚拟机平台
>   -   EVE-NG 操作系统
>   -   火狐浏览器
>   -   Xshell 或者 SecureCRT

我们可通过路由器控制台Console端口、通过调制解调器连接辅助(Aux)端口或通过Telnet 访问思科IOS。访问IOS命令行称为EXEC会话。

### 连接思科路由器

>   ###### 方式1: Console Port
>
>   In any case, when you first configure a device, you have to connect to the `控制台端口(Console Port)`。控制台端口通常是一个RJ-45水晶头和一个DB-9 connector，位于路由器背面，可能设置了密码，也可能没有设置。新式ISR路由器默认将cisco用作用户名和密码。
>
>   <img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303151820099.png" alt="image-20230315182004689" style="zoom:33%;" />
>
>   <img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303151826198.png" alt="image-20230315182622842" style="zoom:50%;" />
>
>   ###### 方式2: Auxiliary port
>
>   也可通过`辅助端口(auxiliary port)`连接思科路由器。辅助端口实际上与控制台端口一样，我们可像使用控制台端口一样使用它，但辅助端口还让你能够配置调制解调器命令，以便将调制解调器连接到路由器。这是一项很好的功能一一如果远程路由器出现了故障，而你需要对其进行`带外配置(out-of-band)`，在网络外进行配置)，这项功能让你能够通过拨号连接其辅助端口。
>
>   ###### 方式3: Telnet or SSH
>
>   连接思科路由器的第三种方式是`使用Telnet程序`或者是`SSH程序`，这是一种带内方式，即通过网络配置路由器，与带外方式相反。Telnet 是一种终端模拟程序，就像哑终端一样。你可使用Telnet 连接路由器上的任何活动接口，如以太网接口和串行端口。通过网络以带内方式连接路由器时，使用本章后面将讨论的安全外壳(SSH) 是一种更安全的方式。

这里要介绍的另一种路由器是2800系列，如图6-2 所示。它取代了2600系列路由器，称为ISR( Integrated Services Router ，集成服务路由器)，但自本书前一版出版后，它也被升级到了2900. ISR系列路由器因其内置了众多服务(如安全)而得名，与2600系列一样，它也是模块化的，但速度快得多，也完美得多一一优雅的设计使其支持更多的连接方式。

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303151130758.jpeg" alt="Cisco Router 2900 Series – ABC" style="zoom:100%;" />



### Shortcut Keys

![image-20220706152502596](https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220706152502596.png)

![image-20220706152543521](https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220706152543521.png)

### 使用管道符 |

管道符 |"  让你能够在配置或其他冗长输出中迅速找到目标，如下例所示:

```sh
Todd#sh run | ?
    append Append redirected output to URL (URLs supporting append operation
    only)
    begin Begin with the line that rnatches
    exclude Exclude lines that rnatch
    include lnclude lines that rnatch
    redirect Redirect output to URL
    section Filter a section of output
    tee Copy output to URL
Todd#sh run | begin interface
    interface FastEthernetOjO
    description Sales VLAN
    ip address 10.10.10.1 255.255.255.248
    duplex auto
    speed auto
    interface FastEthernetOj1
    ip address 172.16.20.2 255.255.255.0 secondary
    ip address 172.16.10.2 255.255.255.0
    duplex auto
```

>   在确定大型路由选择表是否包含特定路由时，我经常使用它，例如:
>
>   ```sh
>   Todd#sh ip route | include 192.168.3.32
>   R 192.168.3.32 [120/2] via 10.10.10.8 , 00 : 00:25 , FastEthernetO/O
>   Todd#
>   ```
>
>   

### 三种操作模式

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303200551891.png" alt="image-20230320055125633" style="zoom: 38%;" />

>   **Note:**
>
>   -   **在任何操作模式下可以直接运行`?`,查看可以执行的命令; 也可以作为命令填充符查询健全的相关命令**;
>   -   可以使用 `no COMMAND`来取消已经执行的命令;
>   -   可以在**Configuration Mode**下使用 `do COMMAND`来执行**Privileged EXEC Mode**下的命令;

#### User EXEC Mode

>   `Router>` : ==User EXEC Mode==, indicated by ">"; `logout` 或者 `exit`退出控制台; 
>
>   -   User EXEC mode is indicated by the ‘greater than sign’ next to the host name of the device;
>   -   权限非常有限, 用于简单查看状态信息

![image-20230315183335889](https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303151833310.png)

####  Privileged Exec Mode

>   `Router#` : 特权EXEC模式, indicated by Hashtag "#"; (通过命令`enable` 进入; `disable`退出到用户模式; `exit`或者`logout` can exit from EXEC);
>
>   -   Provides complete access to view the device’s configuration, restart the device, etc.

```sh
clock set 21:45:36 15 jan 2022  # 设置时间和日期


write    # 将配置写入存储器, 保存配置
copy running-config startup-config  # 意义同上

show startup-config   # 查看开机配置
reload   # 重新加载配置, 即重启

write erase # 擦除所有配置, 即恢复出厂设置

show ip interface brief   # 简略查看所有接口的IP配置
show interfaces ethernet 0/0  # 查看指定接口的IP配置
show running-config interface ethernet 0/0

show ip route  # 查看 路由表
```

```shell
ping 10.1.1.2   
show version # 显示系统硬件的基本配置以及软件版本和启动映像

Router#clock ?
    read-calendar Read the hardware calendar into the clock
    set Set the time and date
    update-calendar Update the hardware calendar from the clock
```



#### Configuration Mode

>   `Router(config)#`: 通过命令`configure terminal` 进入全局配置模式; `exit`或者`end`退出到外面一层:
>
>   ###### 设置主机名 和 所在时区
>
>   ```shell
>   no hostname    # Reset路由器名称
>   
>   clock timezone GMT +2 # 设置当前设备所在的时区
>   do show clock    # 显示时间
>   ```
>
>   >   ###### 主机名命名规则:
>   >
>   >   -   以字母开头, 以数字或字母结尾;
>   >   -   仅由字母, 数字, 短划线和下划线组成, 不能包含空格;
>   >   -   长度不超过 63 个字符
>   >
>   >   >   补充: ?怎样作为字符输入: 按一下 Ctrl + V; 然后输入 ?
>
>   
>
>   ###### 设置banner
>
>   ```sh
>   Todd(config)#banner ?
>       LINE    c banner-text c , where 'c' is a delimiting character
>       exec    Set EXEC process creation banner
>       incoming    Set incoming termina1 1ine banner
>       login   Set login banner
>       motd   Set Message of the Day banner
>       prompt-timeout   Set Message for login authentication timeout
>       slip-ppp    Set Message for SLIP/PPP
>   Router(config)#banner motd #                      
>   Enter TEXT message.  End with the character '#'.
>   ------------------------------------------------
>   come on, Boy!
>   在此内设置 banner, 登录时会出现
>   -----------------------------------------------
>   #
>   Router(config)#
>   
>   ```
>
>   MOTD (Message Of The Day ，每日消息)是最常用的旗标。它向任何拨号或通过Telnet、辅助端口甚至控制台端口连接路由器的人显示Banner.
>
>   
>
>   ###### 其他命令
>
>   ```sh
>   no ip routing    # 禁用路由功能
>   ip default-gateway 192.168.2.1   # 设置此路由器的默认网关
>   ```
>
>   -   It is important to note that the `ip default-gateway` command is used on devices that are not routing packets between different networks. For routers, the "ip route 0.0.0.0 0.0.0.0 <IP-address>" command is used to specify the default route.

##### 接口配置模式:

>   ```sh
>   Router-10(config)# interface e0/0   # 设置指定端口
>   Router-10(config-if)# ip address 10.1.1.1 255.255.255.252  # 设置IP地址
>   Router-10(config-if)# no shutdown # 路由器的接口默认是关闭状态, 需要打开
>   ```
>
>   ###### 逻辑子接口:
>
>   允许你在路由器中创建`逻辑接口`，进入子接口配置模式后，提示符将变成Router (config-subif)#:
>
>   ```shell
>   Router(config-if)#interface fO/O.1
>   Router(config-subif)#
>   ```
>



##### 线路配置模式: `Router(config-line)#`

>   用于配置用户模式密码
>
>   ```shell
>   Router#config t
>   Enter configuration commands , one per line. End with CNTLjZ.
>   Router(config)#line ?
>       <0-337> First Line number
>       aux Auxiliary line
>       console Primary terminal line
>       tty Terminal controller
>       vty Virtual terminal
>   ```
>



##### 路由协议配置模式: `Router(config-router)#`

>   用于配置路由选择协议
>
>   ```shell
>   Router#config t
>   Enter configuration commands , one per line 国End with CNTL/Z.
>   Router(config)#router rip
>   Router(config-router)#version 2
>   Router(config-router)#
>   ```
>



### 接入思科路由器的方式

用于确保思科路由器安全的密码有5种: 

-   `控制台密码`: 用于控制用户通过 `控制台端口` 进入用户模式
-   `辅助端口密码`: 用于控制用户通过 `辅助端口` 进入用户模式
-   `远程登录(VTY) 密码`: 用于控制用户通过`Telnet` 进入用户模式
-   `启用密码(enable password)` : 用于认证准入 特权模式;
-   `启用加密密码(enable secret)`: 用于认证准入 特权模式;

#### 设置特权模式的准入密码

```sh
Todd(config)#enable ?
    last-resort Define enable action if no TACAC5 servers
    respond
    password Assign the privileged level password
    secret Assign the privileged level secret
    use-tacacs Use TACAC5 to check enable passwords
Todd(config)#enable password 密码  # 设置进入特权模式的密码(明文存储)
Todd(config)#do sh run   # 即可查看命令的历史记录, 看可到刚刚设置的明文密码

Todd(config)#enable secret 密码   # 可以设置加密的密码
```

>   命令enable 的参数如下:
>
>   -   last-resort 在使用TACACS 服务器进行身份验证，但该服务器不可用时，让你仍能进入路由器;如果TACACS 服务器可用，则这种密码将不管用。
>   -   password 在10.3之前的老系统上设置启用密码，如果设置了启用加密密码，该密码将不管用。
>   -   secret 较新的加密密码，如果设置了，将优先于启用密码。
>   -   use-tacacs 让路由器使用TACACS 服务器进行身份验证。如果有数十台甚至更多的路由器，这将很方便，毕竟谁会希望在所有这些路由器上修改密码?而使用TACACS 服务器时，你只需修改一次密码。

---

进入用户模式的密码是使用line配置模式下设置的:

```shell
Todd(config)#line ?
    <0-337>   First Line number
    aux    Auxiliary line
    console    Primary terminal line
    tty    Terminal controller
    vty    Virtual terminal
```

>   下面是CCNA 考试涉及的参数:
>
>   -   aux 设置辅助端口的用户模式密码。辅助端口通常用于将调制解调器连接到路由器，但也可用作控制台端口。
>
>   -   console 设置控制台端口的用户模式密码。
>
>   -   vty 设置通过Telnet进入用户模式的密码。如果没有设置这种密码，默认将不能通过Telnet连接到路由器。
>
>       >   要配置用户模式的准入密码，可配置相应的访问方式，并使用命令 `login` 让路由器进行身份验证。

#### 设置控制台端口的准入密码

```shell
ToddCconfig)#line console ?
	<0-0> First Line number
ToddCconfig)#line console 0
ToddCconfig-line)#password console
ToddCconfig-line)#login
```

>   -   由于只有一个控制台端口，因此只能选择编号0.
>
>   -   命令`exec-timeout 0 0` 将控制台EXEC 会话的超时时间设置为0，这意味着永远不超时。默认的超时时间为10 分钟
>
>       ```shell
>       ToddCconfig-line)#line con 。
>       ToddCconfig-line)#exec-timeout?
>       	<0-35791> Timeout in minutes
>       ToddCconfig-line)#exec-timeout 0 ?
>           <0-2147483> Timeout in seconds
>           <cr>
>       ```
>
>       
>
>   -   `logging synchronous`, 默认开启, 不断出现的控制台消息不会中断用户的输入
>
>       ```sh
>       ToddCconfig-line)#logging synchronous
>       ```
>

#### 设置Aux端口的准入密码

```shell
Todd(config)#line aux ?
	<0-0> First Line number
Todd(config)#line aux 0
Todd(config-line)#password aux
Todd(config-line)#login
```

#### 设置Telnet访问路由器的准入密码

要设置使用Telnet 访问路由器时进入用户模式的密码，我们可使用命令1ine vty。如果路由器运行的不是思科IOS企业版，它将默认有5条VTY线路: 0-4。但如果运行的是企业版，线路将多得多。要获悉有多少条线路，最佳的方法是使用问号:

##### 方式一: 配置VTY密码验证

```shell
Todd(config)#line vty 0 ?
<1-1180> Last Line number
<cr>
Todd(config)#line vty 0 1180
Todd(config-1ine)#password telnet111
Todd(config-line)#login
```

>   -   如果试图远程登录没有设置VTY密码的路由器，结果将如何呢?你将看到一条错误消息，它指出连接请求遭到拒绝，因为没有设置密码。
>
>       ```sh
>       Todd#telnet SFRouter
>           Trying SFRouter (10.0.0.1)_Open
>           Password required , but none set
>           [Connection to SFRouter c10sed by foreign host]
>       ```
>
>   -   要绕开这种障碍，让路由器在没有设置Telnet密码时也允许建立Telnet连接，我们可使用`no login`命令:
>
>       ```shell
>       SFRouter(config-line)#line vty 0 4
>       SFRouter(config-line)#no login   # 取消身份认证
>       ```

##### 方式二: 使用已配置的local账号和密码验证

```sh
Todd(config)#username admin password admin  # 提前配置本地账号和密码
Todd(config)#line vty 0 ?
<1-1180> Last Line number
<cr>
Todd(config)#line vty 0 1180
Todd(config-line)#login local    # 登录验证方式为 已提前配置的本地账号和密码
```



---

给路由器配置IP地址后，我们便可使用Telnet程序配置和检查路由器，而不必使用控制台电缆。在任何命令提示符(DOS 或Cisco) 下，我们都可输入telnet来运行Telnet程序。

##### 使用 Telnet:

>   1.   对于思科路由器，使用Telnet应用可以省略 telnet 这个命令; 只要在命令提示符下输入了一个IP地址，思科路由器就会认定操作者是要远程登录此设备。
>
>        ```sh
>        Corp# [telent] 10.2.2.2
>            Trying 10.2.2.2 ... Open
>            Password required , but none set
>            [Connection to 10.2.2.2 c10sed by foreign host]
>        # 这是因为没有在远程服务器上设置 VTY 密码
>        ```
>
>        
>
>   2.   下面是需要在需要登录的路由器上配置VTY密码:
>
>        ```sh
>        R1#config t
>        	Enter configuration commands , one per line. End with CNTLjZ.
>        R1(config)#line vty 0 ?
>            <1-807> Last Line number
>            <cr>
>        Rl(config)#line vty 0 807
>        Rl(config-line)#password telnet111
>        Rl(config-line)#login
>        Rl(config-line)#^Z
>        ```
>
>   3.   再次尝试登录远程路由器:
>
>        ```sh
>        ζorp#10.2.2.2
>            Trying 10.2.2.2 ... Open
>            User Access Verification
>            Password:
>        Rl>en
>        % No password set   
>        # 这是因为在远程服务器上没有设置特权模式的密码, 禁止通过 enable 命令直接进入特权模式, 这是一个很不错的安全特性.
>        Rl>
>        ```
>
>   >   远程登录一个设备时，默认情况下我们是不会看到控制台信息的。例如，在这种情况下不能查看debug 的诊断输出。为了允许将控制台信息发送到Telnet 会话，我们应可以使用``terminal monitor`命令。

###### 同时远程登录多个设备:

保持和远程设备的连接的同时返回原路由器的控制台: 以按下`Ctrl` + `Shift`+`6` 组合键，再释放它，然后再接下`X`键。

###### 其他命令:

```sh
Corp#show sessions   # 查看路由器到远程设备的连接
Corp#show users   # 查看路由器上正在使用中的控制台和所有连接中的VTY端口

ap>exit   # 退出telnet远程登录

Corp#sh session
    Conn         Host Address  	Byte 	Idle Conn Name
    *2 10.2.2.2   10.2.2.2 		 0 		10.2.2.2
Corp#disconnect ?      # 退出指定的会话连接
    <2-2> The number of an actìve network connectìon
    qdm Disconnect QDM web-based clients
    ssh Disconnect an active SSH connection
Corp#disconnect 2
	Closing connection to 10.2.2.2 [confi rm] [enter咽]
Corp#
```



##### 解析主机名:

如果希望使用主机名(而不是IP地址)建立到远程设备的连接，那么这个用来建立连接的设备就必须有能力将主机名转换为IP地址。

>   有两种方法可以实现主机名到IP地址的解析: 
>
>   -   在每个路由器上手动建立一个主机表, 因为主机表只为创建有此表的路由器提供名称解析。;
>   -   组建一个DNS(Domain Name System，域名系统)服务器，这个服务器的功能类似于动态的主机表(或假想的动态DNS)。

###### 手动建立主机表:

```sh
ip host host_name [tcp_port_number] ip_address

Corp#confìg t
    Corp(config)#ip host Rl ?
    <0-65535> Default telnet port number
    A.B.C.D Host IP address
    additional Append addresses
    mx Configure a MX record
    nsζonfigure an NS record
    
Corp(config)#do show hosts
```

###### 使用DNS 解析名称:

默认情况下，每当思科设备接收到一个无法理解的命令时，它都会尝试通过DNS对它进行解析。

>   如果网络上已经配备有DNS服务器，那么要让DNS的名称解析服务起作用，我们还需要再运行一些命令:
>
>   ```sh
>   ζorp#config t
>   Corp(config)#ip domain-lookup   # 此命令是默认开启的。注意，只有在前期关闭了此功能时(使用no i P domain-lookup 命令来实现)，我们才会需要运行这一命令。
>   
>   Corp(config)#ip name-server ?
>   	A.B.C.D Domain server IP address (maximum of 6)
>   Corp(config)#ip name-server 192.168.0.70   # 这个命令用于设置DNS服务器的IP地址。我们最多可以输入6个服务器的IP地址。
>   
>   Corp(config)#ip domain-name 1ammle.com   # 负责将域名附加到输入的主机名后。由于DNS使用的是FQDN( Fully Qualified Domain Name ,完全限定域名)系统，因此必须有一个第二层次的DNS 域名部分，其格式为domain.com。
>   
>   Corp(config)#^Z
>   Corp#
>   ```
>
>   

#### 设置SSH登录方式

我们可以使用SSH替代Telnet。与使用非加密数据流的Telnet相比， SSH创建的会话更安全。SSH 使用加密密钥发送数据，以免以明文方式发送用户名和密码。

>   ###### 设置SSH 的步骤如下:
>
>   ```shell
>   Router(config)#hostname Todd  # 设置主机名
>   Todd(config)#ip domain-name Lammle.com   # 设置域名(为生成加密密钥，必须设置域名)
>   Todd(config)#username Todd password Lammle  # 设置用户名和密码以支持SSH 客户端接人
>   
>   Todd(config)#crypto key generate rsa general-keys modulus ?
>   	<360-2048> size of the key modulus [360-2048J
>   Todd(config)#crypto key generate rsa general-keys modulus 1024
>       The name for the keys will be: Todd.Lammle.com
>       % The key modulus size is 1024 bits
>       % Generating 1024 bit RSA keys , keys will be non-exportable...[OK]
>       *]une 24 19:25:30.035: %SSH-5-ENABLEO: SSH 1 圃99 has been enabled
>       
>   Todd(config)#ssh version 2  # 在路由器上启用SSH第2版。并非必须这样做，但强烈推荐这样做
>   Todd(config)#line vty 0 1180  # 进入路由器VTY线路配置模式
>   Todd(config-line)#transport input ssh
>   ```
>
>   



### 设置Privileged Exec Mode的登录密码:

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303151842495.png" alt="image-20230315184232125" style="zoom: 30%;" />

>   -   `enable password PWD` 会使用明文记录在 running-config 中, `service password-encryption` 可以将其加密, 同时在running-config 中会显示数字7 和密文密码;
>   -   `enable secret PWD`: 会使用MD5加密, 以密文形式记录在 running-config, 比上述方式更加安全;
>   -   当使用两种方式配置了不同的密码, 方式二的密码会覆盖掉方式一的密码.
>
>   <img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303152051668.png" alt="image-20230315205118315" style="zoom:33%;" />

#### 明文密码加密

>   `service password-encryption` 可以将配置的所有访问方式的明文密码进行加密, 不仅限于 `enable password PWD`.
>
>   <img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303152042938.png" alt="image-20230315204250501" style="zoom:33%;" />
>
>   -   在路由器上执行命令`show running-config`时，你将看到除启用加密密码(enable secret)外的其他所有密码;
>   -   要手工配置密码加密，我们可使用命令`service password-encryption`，会将其他的明文密码都进行暗文加密; 
>
>   ```sh
>   Todd#config t
>       Enter configuration commands, one per line. End with CNTL/Z.
>   Todd(config)#service password-encryption
>   Todd(config)#exit
>   Todd#sh run
>       Building configuration...
>       [output cut]
>       !
>       enable secret 5 $1$2R.r$DcRaVo0yBnUJBf7dbG9XE0
>       enable password 7 131118160F
>       !
>       [output cut]
>       !
>       line con 0
>       exec-timeout 0 0
>       password 7 0605002F5F41051C   # This number ‘7’ indicates the type of encryption used to encrypt the password.
>       logging synchronous
>       login
>       line aux 0
>       password 7 03054E13
>       login
>       line vty 0 4
>       access-class 23 in
>       password 7 01070308550E12
>       login
>       transport input telnet ssh
>       line vty 5 15
>       password 7 01070308550E12
>       login
>       transport input telnet ssh
>       line vty 16 1180
>       password 7 120D001B1C0E18
>       login
>       !
>       end
>   Todd#conf t
>   Todd(config)#no service password-encryption
>   Todd(config)#^Z
>   Todd#
>   ```
>
>   -   As I said, if you set your passwords and then turn on the service password-encryption command, you have to perform a show running-config before you turn off the encryption service or your passwords won’t be encrypted.
>   -   `service password-encryption`: **The number 7 means it is using Cisco’s proprietary encryption algorithm**. It's still not totally secure, sometimes simply searching for a cisco type 7 password cracker on google can find a tool to crack it.
>   -   `enable secret PWD`: **The Number 5 indicates MD5 type encryption**, which is much more secure than what we got with

### Description

设置接口描述对管理员很有帮助，与主机名一样，描述也只在本地有意义。命令description很有用，因为可用来标识电路号。

```sh
Todd#config t
Todd(config)#int sO/O/O
Todd(config-if)#description Wan to SF circuit number 6fdda12345678

Todd(config-if)#int faO/O
Todd(config-if)#description Sales VLAN
Todd(config-if)#^Z
Todd#
```

要查看接口的描述，我们可使用命令`show running-config` 或`show interface`:

```sh
Todd#sh run
    [output cut]
    interface FastEthernetOjO
    description Sales VLAN
    ip address 10.10.10.1 255.255.255.248
    duplex auto
    speed auto
    interface SerialOjOjO
    description Wan to SF circuit number 6fdda 12345678
    no ip address
    shutdown
	[output cut]
Todd#sh int fO/O
    FastEthernetOjO is up , line protocol is down
    Hardware is MV96340 Ethernet , address is 00la. 2f55 .cge8 Cb;a 001a.2f5S . cge8)
    Description: Sales VLAN
    [output cut]
Todd#sh int sO/O/O
    SerialOjOjO is -administratively down , line protocol is down
    Hardware i s GT96K Serial
    Description: Wan to SF circuit number 6fdda12345678
```

### interface/serial 

>   建议总是先查看运行配置输出 `show running-config`，以获悉要配置哪些接口。

>   以太网口:
>
>   ```sh
>   interface type slot/port  # 必须指定类型, 插槽号/端口号
>   ```

>   串口: 第一个0 表示路由器本身，第二个编号为插槽号，第三个为端口号。下面是在2811 路由器上选择一个串行接口的命令:
>
>   ```sh
>   Todd(config)#interface serial ?
>   	<0-2> Serial interface number
>   Todd(config)#interface serial O/O/?
>   	<0-1> Serial interface number
>   Todd(config)#interface serial 0/0/0
>   Todd(config-if)#
>   ```

#### 查看接口的信息

```shell
Router#show interface fastethernet 0/0 # 它显示硬件地址、逻辑地址、封装方法以及有关冲突的统计信息
Router#show ip interface    # 显示路由器接口的第三层配置信息: 接口的状态、接口的IP 地址和子网掩码、在接口上是否设置了访问列表以及基本的IP信息。
Router#show ip interface brief  # 提供路由器接口的摘要信息，包括逻辑地址和状态
Router#show protocols  # 了解每个接口的第1层和第2层的状态以及它使用的IP地址。
Router#show controllers  # 显示有关物理接口本身的信息。它还指出了串行端口连接的串行电缆的类型，这通常是与DSU (Data Service Unit ，数据服务单元)相连的DTE电缆。
```



#### 启动接口

要禁用接口，我们可使用接口配置命令`shutdown`; 要启用接口，我们可使用命令`no shutdown` 。

#### 给接口配置IP地址

```sh
Todd(config)#int fO/l
Todd(config-if)#ip address 172.16.10.2 255.255.255.0
Todd(config-if)# no shutdown
```

>   -   如果要给接口配置第二个地址，我们必须使用参数secondary。
>
>       ```sh
>       Todd(config-if)#ip address 172.16.20.2 255 ‘ 255.255.0 ?
>           secondary Make this IP address a secondary address
>           <cr>
>       Todd(config-if)#ip address 172.16.20.2 255.255.255.0 secondary
>       Todd(config-if)#^Z
>       Todd(config-if)#do sh run
>           Building configuration...
>           [output cut]
>           interface FastEthernetOj1
>           ip address 172.16.20.2 255.255.255.0 secondary
>           ip address 172.16.10.2 255.255.255.0
>           duplex auto
>           speed auto
>       ```
>
>       >   不建议给接口配置多个IP地址，因为这种做法糟糕而低效。这里之所以介绍这个主题，是怕你遇到糟糕的网络设计的MIS经理, 他可能会要求你管理这样的网络。

#### 配置串行接口的命令

##### clock rate

我们通常使用串行接口连接CSU/DSU设备，这种设备为路由器线路提供时钟频率; 默认情况下，思科路由器的串行接口都是DTE (Data Terminal Equipment ，数据终端设备)，这意味着如果你想让接口充当DCE设备，必须对其进行配置，使其提供时钟频率。然而，在生产环境的T1连接上，我们不需要提供时钟频率，因为串行接口与CSU/DSU 相连，如图6-4 所示:

![image-20220706173805140](https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220706173805140.png)

>   -   我们可使用命令clock rate 配置DCE 串行接口:
>
>       ```sh
>       Todd#config t
>       Enter‘ configuration commands , one per line. End with CNTL/Z.
>       Todd(config)#int sO/O/O
>       Todd(config-if)#clock rate ?
>       Speed (bits per second)
>           1200
>           2400
>           4800
>           9600
>           14400
>           19200
>           28800, .....
>       Todd(confíg-íf)#clock rate 1000000 # 命令clock rate 以比特每秒为单位
>       ```
>
>       
>
>   -   要确定路由器串行接口连接的是杏是DCE 电缆，我们可查看电缆两端的标签(DCE 或DTE) ，还可使用命令show controllers int:
>
>       ```sh
>       Todd#sh controllers s0/0/0
>       Interface SerialOjOjO
>       Hardware is GT96K
>       DTE V.35idb at Ox4342FζBO. driver data structure at Ox434373D4
>                                       
>       # 下面是关于DCE连接的输出:
>       Todd#sh controllers s0/2/0
>       Inter咽face Ser;alOj2jO
>       Hardware is GT96K
>       DCE V.35 , clock rate 1000000
>       ```
>
>       

##### bandwidth

在所有思科路由器上，串行链路的默认带宽都是T1(1.544 Mbit/s )，但这与数据如何在链路上传输毫无关系, 仅参与路由协议中metrics 的计算:

```sh
Todd(config)#int 50/0/0
Todd(config-if)#bandwidth ?
    <1-10000000> Bandwidth in kilobits
    inherit Specify that bandwidth is inherited
    rece;ve Specify receive-side bandwidth
    Todd(config-if)#bandwidth 1000
# 不同于命令clock rate ，命令bandwidth 使用的单位是千比特每秒，你注意到这一点了吗?
```

### 查看, 保存, 删除配置

There are two separate configuration files kept on the device at Once. 

-   Running-config = the current, active configuration file on the device. As you enter commands in the CLI, you edit the active configuration.
-   Startup-config = the configuration file that will be loaded upon restart of the device.


#### 查看

```sh
Todd#show running-config  # 查看当前的运行配置

Todd#show startup-config  # 查看路由器的NVRAM中保存的配置, 下次重启时将使用该配置，它还指出启动配置文件占用了多少NVRAM
```

#### 保存

把DRAM中运行的配置(称为运行配置)拷贝到NVRAM:

```sh
Todd#copy running-config startup-config    # 方式一

Todd# write memmory       # 方式二

Todd# write    # 此方式三也可以, 且更加简洁
```

#### 删除配置以及重启路由器

```sh
Todd# erase startup-config  # 擦除启动配置

Todd# write erase   # 也可以

Todd# sh startup-config
	startup-config is not present
	
Todd# reload  # 重启
    Proceed with reload? [confirm]System configuration has been modified.
    Save? [yesjno]: n
```

