---
title: 热备份技术
date: 2022-07-13 12:26:14
permalink: /pages/bada2c/
categories:
  - 网络运维
  - CCNA
  - CCNA知识笔记
tags:
  - 
---
#  热备份技术

## FHRP 首跳冗余

>   网关冗余协议:
>
>   -   HSRP
>   -   VRRP
>   -   GLBP

<img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220622191212737.png" alt="image-20220622191212737" style="zoom:67%;" />

FHRP可以带来什么?

<img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220622191638647.png" alt="image-20220622191638647" style="zoom:67%;" />



## HSRP

<img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220622191714964.png" alt="image-20220622191714964" style="zoom:67%;" />

>   -   Active 路由器:
>       -   活跃路由器的竞争:
>           -   优先级: 0~255, 默认为 100;
>           -   IP地址: 越大越优
>       -   只有处于active的路由器才可以响应用户的ARP请求和转发数据;\
>   -   Standby 路由器:
>       -   Standby路由器监听 224.0.0.2的 hello消息, 一旦发现active出现问题(holdtime = 10s), 立刻从Standby升级成为 active 路由器;

实验配置:

![image-20220622194110255](https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220622194110255.png)

>   ==将交换机的接口设置成路由器接口的两种方式:==
>
>   -   方式1: Switchport 属于二层交换机的接口, 不能配置IP; 可通过命令 `no switchport` 可将其设置为 路由器的接口;
>   -   方式2: 将其设置为 SVI 交换机虚拟接口: `vlan 10` 可将交换机的接口设置为 VLAN 10的接口
>       -   双 UP的链路;
>       -   Trunk 链路;



1.   配置两台 PC 设备

     ```shell
     no ip routing
     ip default-gateway 192.168.10.254
     int e0/0
     ip add 192.168.10.1 255.255.255.0
     no shutdown
     end
     ```

2.   配置两台二层交换机

     1.   将 e0/0接口 设置为 access模式并划入 VLAN10

     ````shell
     SW3(config)#int e0/0
     SW3(config-if)#switchport mode access
     SW3(config-if)#switchport access vlan 10
     ````

     2.   将 e0/1 -2 接口设置为 trunk模式, 

     ```sh
     SW3(config-if)#int ran e0/1-2
     SW3(config-if-range)#switchport trunk encapsulation dot1q
     SW3(config-if-range)#sw mode trunk 
     ```

3.   配置交换机 SW1 和 SW2:

     1.   将接口 e0/1-2 设置为 Trunk模式

          ```shell
          SW1(config)#interface range e0/1-2
          SW1(config-if-range)#switchport trunk encapsulation dot1q 
          SW1(config-if-range)#sw mo tr
          ```

     2.   分别创建 vlan 10, vlan 20的SVI接口

          ```shell
          SW1(config)#int range e0/1-2
          SW1(config-if-range)#vlan 10
          SW1(config-vlan)#int vlan 10
          SW1(config-if)#ip address 192.168.10.252 255.255.255.0
          SW1(config-if)#end
          SW1#show ip int br
              Interface              IP-Address      OK? Method Status                Protocol
              Ethernet0/0            unassigned      YES unset  up                    up      
              Ethernet0/1            unassigned      YES unset  up                    up      
              Ethernet0/2            unassigned      YES unset  up                    up      
              Ethernet0/3            unassigned      YES unset  up                    up      
              Vlan10                 192.168.10.252  YES manual administratively down down 
          SW1(config-if)#no shutdown 
          SW1# show ip interface brief 
              Interface              IP-Address      OK? Method Status                Protocol
              Ethernet0/0            unassigned      YES unset  up                    up      
              Ethernet0/1            unassigned      YES unset  up                    up      
              Ethernet0/2            unassigned      YES unset  up                    up      
              Ethernet0/3            unassigned      YES unset  up                    up      
              Vlan10                 192.168.10.252  YES manual up                    up  
              
          SW1(config)#vlan 20
          SW1(config-vlan)#int vlan 20
          SW1(config-if)#ip add 192.168.20.252 255.255.255.0
          SW1(config-if)#no shut
          ```

     3.   将 e0/0接口也设置为 Trunk接口

          ```shell
          SW1(config)#int e0/0
          SW1(config-if)#sw tr en do
          SW1(config-if)#sw tr en dot1q 
          SW1(config-if)#sw mo tr
          ```

     4.   虚拟出网关 192.168.10.254

          ```shell
          SW1(config)#int vlan 10
          SW1(config-if)#do sh run int vlan 10
              Building configuration...
          
              Current configuration : 65 bytes
              !
              interface Vlan10
               ip address 192.168.10.252 255.255.255.0
              end
          SW1(config-if)#standby 1 ip 192.168.10.254
          
          SW2#sh standby brief 
                               P indicates configured to preempt.
                               |
          Interface   Grp  Pri P State   Active          Standby         Virtual IP
          Vl10        1    100   Standby 192.168.10.252  local           192.168.10.254
          ```

4.   将SW3设置为 VLAN 10的主路径; 将 SW4 设置为 VLAN 20的主路径

     ```sh
     SW3(config)#spanning-tree vlan 10 priority 0
     SW3#sh sp vlan 10
         VLAN0010
           Spanning tree enabled protocol rstp
           Root ID    Priority    10
                      Address     aabb.cc00.5000
                      This bridge is the root
                      Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
     
     SW4(config)#spanning-tree vlan 20 priority 0
     SW4# sh sp vlan 20
         VLAN0020
           Spanning tree enabled protocol rstp
           Root ID    Priority    20
                      Address     aabb.cc00.6000
                      This bridge is the root
                      Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
                  
     SW2#sh spanning-tree vlan 20
         VLAN0020
           Spanning tree enabled protocol rstp
           Root ID    Priority    20
                      Address     aabb.cc00.6000
                      Cost        100
                      Port        2 (Ethernet0/1)
                      Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
     ```

5.   将SW1 设置为 preempt 模式(若本身的优先级更高, 则会进入Active模式)

     ```shell
     SW1(config)#int vlan 10
     SW1(config-if)#standby 1 priority 110  # 更改优先级 大于 100
     SW1(config-if)#standby 1 preempt 
     SW1(config-if)#end 
     
     SW1#sh standby brief
                              P indicates configured to preempt.
                              |
         Interface   Grp  Pri P State   Active          Standby         Virtual IP
         Vl10        1    110 P Active  local           192.168.10.253  192.168.10.254
     ```

6.   设置路由器 R7

     ```shell
     R7(config)#int loopback 0
     R7(config-if)#ip add 1.1.1.1 255.255.255.255
     R7(config-if)#no shut
     
     R7(config)#int e0/0
     R7(config-if)#ip add 10.1.1.3 255.255.255.0
     R7(config-if)#no shut
     R7(config-if)#end
     
     R7(config)#router eigrp 1
     R7(config-router)#no auto-summary
     R7(config-router)#network 0.0.0.0
     
     R7(config)#int e0/1
     R7(config-if)#ip add 10.1.2.3 255.255.255.0
     R7(config-if)#no shut
     ```

7.   设置 SW1 和 SW2 的接口为 SVI接口, 并设置 IP地址

     ```shell
     SW1(config)#int e0/3
     SW1(config-if)#no switchport 
     SW1(config-if)#ip add 10.1.1.1 255.255.255.0
     SW1(config-if)#router ei 1
     SW1(config-router)#no auto-summary
     SW1(config-router)#net 0.0.0.0
     ```

<img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220623190753113.png" alt="image-20220623190753113" style="zoom:80%;" />

<img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220623190841307.png" alt="image-20220623190841307" style="zoom:80%;" />

## VRRP

<img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220623190939580.png" alt="image-20220623190939580" style="zoom:80%;" />

<img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220623191003888.png" alt="image-20220623191003888" style="zoom: 67%;" />

<img src="https://cdn.jsdelivr.net/gh/Wolfxin/MyPicGo/img/image-20220623191019824.png" alt="image-20220623191019824" style="zoom: 50%;" />

## 关联 Track



