---
title: Switching_EtherChannel
date: 2023-03-29 10:27:26
permalink: /pages/85147b/
categories:
  - 网络运维
  - CCNA
  - CCNA知识笔记
tags:
  - 
---

## EtherChannel

-   [ ] configure and verify Layer 2 and Layer 3 EtherChannel using LACP(Link Aggregation Control Protocol);
-   [ ] 

### Intro

>   -   EtherChannel allows you to group multiple physical interfaces into a group which operates as a single logical interface, so they behave as if they are a single interface.
>       -   A Layer 2 Etherchannel is a group of switch ports which operate as a single interface;
>       -   a Layer 3 Etherchannel is a group of routed port which operate as a single interface, which you assign an IP address to, because it’s Layer 3.

##### The problem without Etherchannel

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303292353185.png" alt="image-20230329235325076" style="zoom:38%;" />

>   -   ASW1: *Access layer Switch*, a switch that *end hosts* connect to;
>   -   DSW1: *Distribution layer switch*, a switch that *access layer switches* connect to;
>   -   When the bandwidth of the interfaces connected to end hosts is greater than the bandwidth of the connection to the distribution switch(es), this is called **Over-Subscription**.  Some oversubscription is acceptable, but too much will cause congestion.
>
>   ##### Problems:
>
>   -   Because of STP, 
>
>       -   If you connect two switches together with multiple links, all except one will be disabled
>
>           by spanning tree. Other links will be unused unless the active link fails.
>
>       -   if all of ASW1’s interfaces were forwarding, Layer 2 loops would form between ASW1 and
>
>           DSW1, leading to Broadcast Storms.
>
>   ##### Solution:
>
>   However, by forming these four physical interfaces into one logical interface, **EtherChannel** can solve this problem, giving us *both redundancy and increased bandwidth*.
>

### Etherchannel

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300003921.png" alt="image-20230330000351819" style="zoom:38%;" />

>   -   An EtherChannel is represented in network diagrams by **drawing a circle** around the interfaces
>
>       that are grouped together; Some other names for an EtherChannel are: 
>
>       -   Port Channel 
>       -   LAG (Link Aggregation Group)
>
>   -   EtherChannel **groups multiple interfaces together to act as a single (virtual) interface**. 
>
>       -   *STP will treat this group as a single interface.*
>       -   The bandwidth of the *four separate* interfaces is combined to form *one 4-times* bandwidth interface,
>
>       <img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300009516.png" alt="image-20230330000938418" style="zoom:33%;" />
>
>   -   Traffic using the EtherChannel will be **load balanced** among the physical interfaces in the group. An algorithm is used to determine which traffic will use which physical interface. 
>
>       <img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300015653.png" alt="image-20230330001518549" style="zoom:31%;" />
>
>       -   EtherChannel load balances based on ‘**flows**’. A flow is a communication between two nodes in the network. 
>       -   **Frames in the same flow will be forwarded using the same physical interface.** 
>           -   If frames in the same flow were forwarded using different physical interfaces, some frames 
>               may arrive at the destination out of order, which could cause problems.
>           -   Some applications can deal with frames arriving out of order, but some applications can’t.
>       -   The algorithm that is done to determine which physical interface to use takes into account a few inputs:
>           -   MAC address: 
>               -   *Source MAC address*, 
>               -   *Destination MAC address*, 
>               -   *Src & Dest MAC addresses*
>           -   IP address: 
>               -   *Source IP*, 
>               -   *Dest IP*, 
>               -   *Src & Dest IP addresses*;
>           -   Some switches also support load-balancing based on the *Layer 4 TCP or UDP port numbers*;
>
>   ```sh
>   # check the load-balancing method 
>   ASW1#show etherchannel load-balance 
>   EtherChannel Load-Balancing Operational State (src-mac):
>   Non-IP: Source MAC address         
>   # if an IP packet isn’t encapsulated in the Ethernet frame, there is no IP address that can be used to determine the load-balancing, so the MAC addresses are used instead.   
>     IPv4: Source MAC address
>     IPv6: Source MAC address
>   
>   
>   # change the load-balancing method 
>   ASW1#conf t
>   ASW1(config)#port-channel load-balance ?
>     dst-ip       Dst IP Addr
>     dst-mac      Dst Mac Addr
>     src-dst-ip   Src XOR Dst IP Addr
>     src-dst-mac  Src XOR Dst Mac Addr
>     src-ip       Src IP Addr
>     src-mac      Src Mac Addr
>   ```

### Etherchannel Types

#### Intro

>   There are three methods of EtherChannel configuration on Cisco switches: 
>
>   ##### PAgP `端口聚合协议`
>
>   + (Port Aggregation Protocol)
>
>   + Cisco proprietary protocol 
>
>   + Dynamically negotiates the creation/maintenance of the EtherChannel. (like DTP does for trunks) 
>
>   
>
>   ##### LACP: `链路聚合控制协议` ==Recommended!==
>
>   + (Link Aggregation Control Protocol)
>
>   + Industry standard protocol (**IEEE 802.3AD**) 
>
>   + Dynamically negotiates the creation/maintenance of the EtherChannel. (like DTP does for trunks) 
>
>
>   >   **Up to 8 interfaces** can be formed into a single EtherChannel (**LACP allows up to 16**, *but only 8 will be active*, the other 8 will be in standby mode, waiting for an active interface to fail)
>
>   ##### Static EtherChannel 
>
>   + A protocol isn’t used to determine if an EtherChannel should be formed. 
>   + Interfaces are statically configured to form an EtherChannel. 
>

#### Modes

> ##### Static Etherchannel:
>
> - `on` Mode that forces the LAN port to form Etherchannel **without using negotiation protocol**. 
> - In the `on` mode, a usable EtherChannel exists **only when** *a LAN port group in the `on` mode* is connected to *another LAN port group in the `on` mode*. Because ports configured in the on mode do not negotiate, there is no negotiation traffic between the ports. You cannot configure the on mode with an EtherChannel protocol. **If one end uses the on mode, the other end must also.**
>
> 
>
> ##### PAgP 协议
>
> - ==auto==: PAgP mode that places a LAN port into a *passively* negotiating state, in which the port responds to PAgP packets it receives but does not initiate PAgP negotiation. **(Default)**
> - ==desirable==: PAgP mode that places a LAN port into an *actively* negotiating state, in which the port initiates negotiations with other LAN ports by sending PAgP packets.
>
> 
>
> ##### LACP 协议
>
> - ==passive==: LACP mode that places a port into a *passively* negotiating state, in which the port responds to LACP packets it receives but does not initiate LACP negotiation. **(Default)**
>
> - ==active==: LACP mode that places a port into an *actively* negotiating state, in which the port initiates negotiations with other ports by sending LACP packets. 
>
> Reference: <https://www.cisco.com/c/en/us/td/docs/switches/lan/catalyst4500/12-2/3-1-1SG/configuration/guide/config/channel.html>

>   #### Summary of valid modes
>
>   -   Static: `on` <-> `on`
>   -   PAgP
>       -   `auto` <-> `desirable`
>       -   `desirable` <-> `desirable`
>   -   LACP:
>       -   `passive` <-> `active`
>       -   `active` <-> `active` 

### Configuration

#### Initiate an Etherchannel

```sh
ASW1(config)#interface range g0/1-2
ASW1(config-if-range)#channel-?
channel-group  channel-protocol  

# channel-group
ASW1(config-if-range)#channel-group ?
  <1-6>  Channel group number
ASW1(config-if-range)#channel-group 1 mode ?
  active     Enable LACP unconditionally
  auto       Enable PAgP only if a PAgP device is detected
  desirable  Enable PAgP unconditionally
  on         Enable Etherchannel only
  passive    Enable LACP only if a LACP device is detected

ASW1(config-if-range)#channel-group 1 mode active
  
  
# channnel-protocol , this command is Useless, because last command can auto set the Ethnerchannel Type
ASW1(config-if-range)#channel-protocol ?
  lacp  Prepare interface for LACP protocol
  pagp  Prepare interface for PAgP protocol
  
  
# 省略 DSW1 的命令
```

>   -   Remember that the `channel-group` command is used to configure the etherchannel, but the name of the virtual interface that is created is **port-channel**.
>   -   The *channel-group number* has to match for member interfaces on the same switch. However, it doesn’t have to match the channel-group number on the other switch. (channel-group 1 on ASW1 can form an EtherChannel with channel-group 2 on DSW1)

#### configure the port-channel interface

```sh
ASW1(config)#interface port-channel ?
  <1-6>  Port-channel interface number
ASW1(config)#interface port-channel 1
ASW1(config-if)#?
  arp             Set arp type (arpa, probe, snap) or timeout
  bandwidth       Set bandwidth informational parameter
  cdp             Global CDP configuration subcommands
  delay           Specify interface throughput delay
  description     Interface specific description
  duplex          Configure duplex operation.
  exit            Exit from interface configuration mode
  hold-queue      Set hold queue depth
  no              Negate a command or set its defaults
  service-policy  Configure QoS Service Policy
  shutdown        Shutdown the selected interface
  spanning-tree   Spanning Tree Subsystem
  speed           Configure speed operation.
  storm-control   storm configuration
  switchport      Set switching mode characteristics
  tx-ring-limit   Configure PA level transmit ring limit
ASW1(config-if)#switchport ?
  access         Set access mode characteristics of the interface
  mode           Set trunking mode of the interface
  nonegotiate    Device will not engage in negotiation protocol on this
                 interface
  port-security  Security related command
  priority       Set appliance 802.1p priority
  protected      Configure an interface to be a protected port
  trunk          Set trunking characteristics of the interface
  voice          Voice appliance attributes
  
ASW1(config-if)#switchport trunk encapsulation dot1q  # the command maybe not exist if support dot1q

ASW1(config-if)#switchport mode trunk 


# 省略 DSW1 的命令
```

>   **Important**: 
>
>   -   Member interfaces(the physical interfaces) in the EtherChannel, must have matching configurations: 
>
>       -   Same duplex (full/half) 
>
>       -   Same speed 
>
>       -   Same switchport mode (access/trunk) 
>
>       -   Same allowed VLANs/native VLAN (for trunk interfaces) 
>
>   -   If an interface’s configurations do not match the others, it will be excluded from the EtherChannel.

#### Check the status of an EtherChannel

```sh
ASW1#show etherchannel ?
  load-balance  Load-balance/frame-distribution scheme among ports in
                port-channel
  port-channel  Port-channel information
  summary       One-line summary per channel-group
  <cr>
  
ASW1#show etherchannel summary
ASW1#show etherchannel port-channel
```

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300246804.png" alt="image-20230330024612582" style="zoom:40%;" />

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300246610.png" alt="image-20230330024638386" style="zoom:40%;" />

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300246236.png" alt="image-20230330024655022" style="zoom:42%;" />

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300249069.png" alt="image-20230330024934887" style="zoom:45%;" />

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300250633.png" alt="image-20230330025018431" style="zoom:33%;" />

### Layer-3 Etherchannel

>   Modern network design often leans toward using Layer 3 connections between switches, because that way spanning-tree won’t be an issue anywhere in the network.
>
>   <img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300253867.png" alt="image-20230330025353727" style="zoom:33%;" />
>
>   <img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300254358.png" alt="image-20230330025416216" style="zoom:33%;" />

```sh
DSW1(config)#interface range g1/0/3 - 4
DSW1(config-if-range)#no switchport 
DSW1(config-if-range)#channel-group 1 mode active 
Creating a port-channel interface Port-channel 1
```

>   **Note:** use the `no switchport` command to make them Layer 3 routed interfaces, which can don't worry about STP.



```sh
DSW1(config)#interface port-channel 1
DSW1(config-if)#ip address 10.0.0.1 255.255.255.252   # already in up state, no need to execute `no shutdown` 
```

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300305690.png" alt="image-20230330030530484" style="zoom:39%;" />

<img src="https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303291027093.png" alt="image-20220622025022846" style="zoom:40%;" />

### Commands summary

```sh
Sw(config) port-channel load-balance mode 
#configures the EtherChannel load-balancing method on the switch 

SW# show etherchannel load-balance 
#displays information about the load-balancing settings 

Sw(config-if)# channel-group number mode { desirable | auto | active | passive } 
#configures an interface to be part of an EtherChannel 

SW# show etherchannel summary 
#displays a summary of EtherChannels on the switch 

SwW# show etherchannel port-channel 
#displays information about the virtual port-channel interfaces on the switch
```

### Quiz:

![image-20230330031230980](https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303300312279.png)



# VSS & 堆叠

VSS: 虚拟交换系统, 捆绑交换机

堆叠线:

![image-20220622183035295](https://cdn.jsdelivr.net/gh/Jonas-Wolfxin/MyPicgo/img/202303291027527.png)